---
kind: property
id: P:Autodesk.Revit.DB.Transform1D.Translation
source: html/d9925294-c813-03d5-d540-53a1f2534640.htm
---
# Autodesk.Revit.DB.Transform1D.Translation Property

The translational part of this transformation.

## Syntax (C#)
```csharp
public double Translation { get; set; }
```